/**
 * Created by ANDREY on 29.06.2017.
 */
import java.util.Scanner;

public class main

{
    static Integer питання_для_цілого_типу(String y)
    {
        Scanner sc = new Scanner(System.in);
        int Y;
        System.out.print(y);

        // Виняток, так як можуть ввести свій вік у вигляді дробового числа(кількість років та місяців) посилання на варіанти вирішень http://www.quizful.net/post/java-exceptions
        try {
            Y = sc.nextInt();
        }
        catch (Exception Year)
        {
            System.out.println("Будь-ласка введіть лише кількість повних років");
            Y = питання_для_цілого_типу(y);
        }
        return Y;
    }

    static String питання_для_рядкового_типу(String Q)
    {
        Scanner scan = new Scanner(System.in);
        System.out.print(Q);
        Q = scan.nextLine();
        return Q;
    }


    static void Підпрограмма_для_виведення_можливих_варіантів_у_таблицях_та_тексті(String Имя, String Город, int Возраст, String Хобби) //всі потрібні нам змінні для виведення



            // Можливі варіанти згідно завдання
    {
        System.out.println();

  //        Таблиця 1

        //      Имя: ххххх
        //      Город: хххххх
        //      Возраст: хххххх
        //      Хобби: хххххх
        System.out.println

                ("Имя: " + Имя
                + "\nГород: " + Город
                + "\nВозраст: " + "" + Возраст
                + "\nХобби: " + Хобби + "\n"
                );

    //




//        Текстовий варіант

       // Человек по имени хххххх живет в городе хххххх.
       // Этому человеку хххххх лет и любит он заниматься хххххх.


        System.out.println

                    (
                "Человек по имени " + Имя + " живет в городе " + Город +".\n"
                + "Этому человеку " + Возраст + " лет и любит он заниматься (эго любимое занятие)" + Хобби + ".\n"
                    );


        //






//        Таблиця 2(навпаки)

    //    хххххх - имя
    //    хххххх - город
     //   хххххх - возраст
     //   хххххх - хобби
        System.out.println

                (Имя + " - имя\n"
                + Город + " - город\n"
                + Возраст + " - возраст\n"
                + Хобби + " - хобби\n"
                );
    }


    // Власне виклик підпрограмми з виведенням питання
    public static void main(String[] args)
    {

        Підпрограмма_для_виведення_можливих_варіантів_у_таблицях_та_тексті
                (питання_для_рядкового_типу("Вітаю, як вас звати? "),
                питання_для_рядкового_типу("В якому місті ви проживаєте "),
                питання_для_цілого_типу("Який ваш вік?(Лише число) "),
                питання_для_рядкового_типу("Які у вас є захоплення(Хоббі)? ")
                );
    }
}